{
  "architectures": [
    "MiniGPT"
  ],
  "frame_size": [
    1,
    32,
    64
  ],
  "model_type": "mini_gpt",
  "n_embd": 256,
  "n_head": 4,
  "n_layer": 2,
  "n_positions": 128,
  "torch_dtype": "float32",
  "transformers_version": "4.48.2",
  "vocab_size": 50257
}
